# ============================================================
# Frahoosh Mobile
# تنظیمات نسخه موبایل فراهوش
# ============================================================

APP_NAME = "فراهوش"

SYSTEM_TITLE = "سامانه هوشمند آموزشی یکپارچه"

# ------------------------------------------------------------
# نسخه برنامه
# ------------------------------------------------------------

APP_VERSION = "1.0.0"

# ------------------------------------------------------------
# شناسه برنامه
# بسیار مهم برای دریافت Update
# در تمام نسخه‌های بعدی باید ثابت بماند
# ------------------------------------------------------------

PACKAGE_NAME = "ir.frahoosh.school"

# ------------------------------------------------------------
# اطلاعات انتشار
# ------------------------------------------------------------

DEVELOPER_NAME = "تیم توسعه فراهوش"

# ------------------------------------------------------------
# تنظیمات سیستم به‌روزرسانی
# ------------------------------------------------------------

UPDATE_CHECK_ENABLED = True

# بعداً آدرس واقعی سرور انتشار APK اینجا قرار می‌گیرد
UPDATE_SERVER_URL = ""

# ------------------------------------------------------------
# اطلاعات مدرسه
# ------------------------------------------------------------

SCHOOL_NAME = "دبیرستان سردار شهید حاجی‌زاده ۲"

SCHOOL_YEAR = ""

SCHOOL_LOGO = "assets/school_logo.png"